<?xml version="1.0"?>
<net name="TensorFlow_Frontend_IR" version="11">
	<layers>
		<layer id="0" name="conv2d_24_input" type="Parameter" version="opset1">
			<data shape="?,28,28,1" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="conv2d_24_input">
					<dim>-1</dim>
					<dim>28</dim>
					<dim>28</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_918" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="0" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Transpose_919" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>28</dim>
					<dim>28</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Transpose_921" type="Const" version="opset1">
			<data element_type="f32" shape="32, 1, 3, 3" offset="32" size="1152" />
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Convolution_922" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="valid" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Transpose_1728" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="1184" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Transpose_1730" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Relu_1731" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Constant_3101" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="1312" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Multiply_3096" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Constant_3104" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="1440" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Transpose_1756" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Transpose_949" type="Const" version="opset1">
			<data element_type="f32" shape="32, 32, 3, 3" offset="1568" size="36864" />
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Convolution_950" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="valid" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Transpose_1760" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="38432" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Transpose_1762" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Relu_1763" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Constant_3115" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="38560" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Multiply_3110" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Constant_3118" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="38688" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Transpose_1788" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="MaxPool_976" type="MaxPool" version="opset8">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="2, 2" rounding_type="floor" auto_pad="valid" index_element_type="i64" axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
				<port id="2" precision="I64">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Transpose_982" type="Const" version="opset1">
			<data element_type="f32" shape="64, 32, 3, 3" offset="38816" size="73728" />
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Convolution_983" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="valid" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Transpose_1792" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="112544" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Transpose_1794" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Relu_1795" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Constant_3129" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="112800" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Multiply_3124" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Constant_3132" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="113056" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Transpose_1820" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Transpose_1010" type="Const" version="opset1">
			<data element_type="f32" shape="64, 64, 3, 3" offset="113312" size="147456" />
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Convolution_1011" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="valid" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Transpose_1824" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="260768" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Transpose_1826" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Relu_1827" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Constant_3143" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="261024" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Multiply_3138" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Constant_3146" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="261280" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Transpose_1852" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="MaxPool_1037" type="MaxPool" version="opset8">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="2, 2" rounding_type="floor" auto_pad="valid" index_element_type="i64" axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Constant_1038" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="261536" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="sequential_6/max_pooling2d_12/MaxPool" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="sequential_6/dropout_16/Identity,sequential_6/dropout_16/Identity:0,sequential_6/max_pooling2d_12/MaxPool,sequential_6/max_pooling2d_12/MaxPool:0">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>4</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="sequential_6/flatten_6/Const" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="261568" size="16" />
			<output>
				<port id="0" precision="I64" names="sequential_6/flatten_6/Const,sequential_6/flatten_6/Const:0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="sequential_6/flatten_6/Reshape" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>4</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="sequential_6/flatten_6/Reshape,sequential_6/flatten_6/Reshape:0">
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Constant_3054" type="Const" version="opset1">
			<data element_type="f32" shape="512, 1024" offset="261584" size="2097152" />
			<output>
				<port id="0" precision="FP32">
					<dim>512</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="sequential_6/dense_13/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="sequential_6/dense_13/MatMul,sequential_6/dense_13/MatMul:0">
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Constant_3157" type="Const" version="opset1">
			<data element_type="f32" shape="1, 512" offset="2358736" size="2048" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="sequential_6/dense_13/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="sequential_6/dense_13/BiasAdd,sequential_6/dense_13/BiasAdd:0">
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="sequential_6/dense_13/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="sequential_6/dense_13/Relu,sequential_6/dense_13/Relu:0">
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Constant_3158" type="Const" version="opset1">
			<data element_type="f32" shape="1, 512" offset="2360784" size="2048" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="sequential_6/batch_normalization_34/batchnorm/mul_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="sequential_6/batch_normalization_34/batchnorm/mul_1,sequential_6/batch_normalization_34/batchnorm/mul_1:0">
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Constant_3159" type="Const" version="opset1">
			<data element_type="f32" shape="1, 512" offset="2362832" size="2048" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="sequential_6/batch_normalization_34/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="sequential_6/batch_normalization_34/batchnorm/add_1,sequential_6/batch_normalization_34/batchnorm/add_1:0,sequential_6/dropout_17/Identity,sequential_6/dropout_17/Identity:0">
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Constant_3058" type="Const" version="opset1">
			<data element_type="f32" shape="10, 512" offset="2364880" size="20480" />
			<output>
				<port id="0" precision="FP32">
					<dim>10</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="sequential_6/dense_14/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>10</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="sequential_6/dense_14/MatMul,sequential_6/dense_14/MatMul:0">
					<dim>-1</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Constant_3160" type="Const" version="opset1">
			<data element_type="f32" shape="1, 10" offset="2385360" size="40" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="sequential_6/dense_14/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="sequential_6/dense_14/BiasAdd,sequential_6/dense_14/BiasAdd:0">
					<dim>-1</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="sequential_6/dense_14/Softmax" type="SoftMax" version="opset8">
			<data axis="-1" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="dense_14">
					<dim>-1</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="dense_14" type="Result" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>10</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="2" to-port="0" />
		<edge from-layer="1" from-port="0" to-layer="2" to-port="1" />
		<edge from-layer="2" from-port="2" to-layer="4" to-port="0" />
		<edge from-layer="3" from-port="0" to-layer="4" to-port="1" />
		<edge from-layer="4" from-port="2" to-layer="6" to-port="0" />
		<edge from-layer="5" from-port="0" to-layer="6" to-port="1" />
		<edge from-layer="6" from-port="2" to-layer="7" to-port="0" />
		<edge from-layer="7" from-port="1" to-layer="9" to-port="0" />
		<edge from-layer="8" from-port="0" to-layer="9" to-port="1" />
		<edge from-layer="9" from-port="2" to-layer="11" to-port="0" />
		<edge from-layer="10" from-port="0" to-layer="11" to-port="1" />
		<edge from-layer="11" from-port="2" to-layer="13" to-port="0" />
		<edge from-layer="12" from-port="0" to-layer="13" to-port="1" />
		<edge from-layer="13" from-port="2" to-layer="15" to-port="0" />
		<edge from-layer="14" from-port="0" to-layer="15" to-port="1" />
		<edge from-layer="15" from-port="2" to-layer="16" to-port="0" />
		<edge from-layer="16" from-port="1" to-layer="18" to-port="0" />
		<edge from-layer="17" from-port="0" to-layer="18" to-port="1" />
		<edge from-layer="18" from-port="2" to-layer="20" to-port="0" />
		<edge from-layer="19" from-port="0" to-layer="20" to-port="1" />
		<edge from-layer="20" from-port="2" to-layer="21" to-port="0" />
		<edge from-layer="21" from-port="1" to-layer="23" to-port="0" />
		<edge from-layer="22" from-port="0" to-layer="23" to-port="1" />
		<edge from-layer="23" from-port="2" to-layer="25" to-port="0" />
		<edge from-layer="24" from-port="0" to-layer="25" to-port="1" />
		<edge from-layer="25" from-port="2" to-layer="26" to-port="0" />
		<edge from-layer="26" from-port="1" to-layer="28" to-port="0" />
		<edge from-layer="27" from-port="0" to-layer="28" to-port="1" />
		<edge from-layer="28" from-port="2" to-layer="30" to-port="0" />
		<edge from-layer="29" from-port="0" to-layer="30" to-port="1" />
		<edge from-layer="30" from-port="2" to-layer="32" to-port="0" />
		<edge from-layer="31" from-port="0" to-layer="32" to-port="1" />
		<edge from-layer="32" from-port="2" to-layer="34" to-port="0" />
		<edge from-layer="33" from-port="0" to-layer="34" to-port="1" />
		<edge from-layer="34" from-port="2" to-layer="35" to-port="0" />
		<edge from-layer="35" from-port="1" to-layer="37" to-port="0" />
		<edge from-layer="36" from-port="0" to-layer="37" to-port="1" />
		<edge from-layer="37" from-port="2" to-layer="39" to-port="0" />
		<edge from-layer="38" from-port="0" to-layer="39" to-port="1" />
		<edge from-layer="39" from-port="2" to-layer="40" to-port="0" />
		<edge from-layer="40" from-port="1" to-layer="42" to-port="0" />
		<edge from-layer="41" from-port="0" to-layer="42" to-port="1" />
		<edge from-layer="42" from-port="2" to-layer="44" to-port="0" />
		<edge from-layer="43" from-port="0" to-layer="44" to-port="1" />
		<edge from-layer="44" from-port="2" to-layer="46" to-port="0" />
		<edge from-layer="45" from-port="0" to-layer="46" to-port="1" />
		<edge from-layer="46" from-port="2" to-layer="48" to-port="0" />
		<edge from-layer="47" from-port="0" to-layer="48" to-port="1" />
		<edge from-layer="48" from-port="2" to-layer="49" to-port="0" />
		<edge from-layer="49" from-port="1" to-layer="51" to-port="0" />
		<edge from-layer="50" from-port="0" to-layer="51" to-port="1" />
		<edge from-layer="51" from-port="2" to-layer="53" to-port="0" />
		<edge from-layer="52" from-port="0" to-layer="53" to-port="1" />
		<edge from-layer="53" from-port="2" to-layer="55" to-port="0" />
		<edge from-layer="54" from-port="0" to-layer="55" to-port="1" />
		<edge from-layer="55" from-port="2" to-layer="57" to-port="0" />
		<edge from-layer="56" from-port="0" to-layer="57" to-port="1" />
		<edge from-layer="57" from-port="2" to-layer="58" to-port="0" />
		<edge from-layer="58" from-port="1" to-layer="59" to-port="0" />
	</edges>
	<rt_info>
		<MO_version value="2023.0.1-11005-fa1c41994f3-releases/2023/0" />
		<Runtime_version value="2023.0.1-11005-fa1c41994f3-releases/2023/0" />
		<conversion_parameters>
			<is_python_api_used value="False" />
			<output_dir value="DIR" />
			<saved_model_dir value="DIR" />
		</conversion_parameters>
		<legacy_frontend value="False" />
	</rt_info>
</net>
